Revit 2026 API

# ExporterIFCGet3DContextHandle Method

---

Obtains the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAnyHandle Get3DContextHandle(
	string subContextName
)
```
```vb
Public Function Get3DContextHandle (
	subContextName As String
) As IFCAnyHandle
```
```cpp
public:
IFCAnyHandle^ Get3DContextHandle(
	String^ subContextName
)
```
```fsharp
member Get3DContextHandle :
        subContextName : string -> IFCAnyHandle
```

#### Parameters

subContextName String
     The name of the IfcRepresentationSubContext, or the IfcRepresentationContext if the string is empty, for 3D entities.

#### Return Value

IFCAnyHandle The IfcRepresentationContext for 3D entities.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The context handle automatically incorporates the angle to true north for the document.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace